zsert3/STM32F051R8_StayAtHomeTrainer/projects/MainProject/inc/helper.h
/**
******************************************************************************
* @file     helper.h 
* @author 	
* @version	V0.0.1
* @date   	?? - ?? - ????
* @brief  	
******************************************************************************
*/
  
#ifndef _helper_H
#define _helper_H
  
#ifdef __cplusplus
extern "C" {
#endif

#include "stm32f0xx.h"

/* Public functions --------------------------------------------------------*/
void Delay(const int d);
void Delay2(const int d);
/* Public variables --------------------------------------------------------*/
typedef struct 
{
	union {	uint16_t value; uint8_t bytes[2]; }duration;
	union { uint32_t value; uint8_t bytes[4]; }intensity;
	union { uint8_t value; uint8_t bytes[1]; }startDateDD;
	union { uint8_t value; uint8_t bytes[1]; }startDateMM;
	union {	uint16_t value; uint8_t bytes[2]; }startDateYYYY;
}revalidationData;

typedef struct 
{
		union {	uint16_t value; uint8_t bytes[2]; }duration;
		union { uint8_t value; uint8_t bytes[1]; }startDateDD;
		union { uint8_t value; uint8_t bytes[1]; }startDateMM;
		union {	uint16_t value; uint8_t bytes[2]; }startDateYYYY;
		
		union {	uint16_t value; uint8_t bytes[2]; }averageRPM;
		union {	uint16_t value; uint8_t bytes[2]; }averageTorgue;
		union {	uint16_t value; uint8_t by tes[2]; }averagePower;
		union {	uint16_t value; uint8_t bytes[2]; }averageAngle;
		union {	uint16_t value; uint8_t bytes[2]; }averageSymmetry;
		union {	uint16_t value; uint8_t bytes[2]; }calories;
}revalidationData2;

typedef struct
{
	union {	uint16_t value; uint8_t bytes[2]; }tailAdress;
	union {	uint64_t value; uint8_t bytes[8]; }randomData;
}initPage;

typedef struct
{
	uint64_t sumRPM;
	uint64_t sumTorgue;
	uint64_t sumPower;
	uint64_t sumAngle;
	uint64_t sumSymmetry;
}average;

#ifdef __cplusplus

}

#endif

#endif /* _helper_H */
